// -*- mode: c++; -*-
#pragma once

#include "Core/Base.h"
#include "Core/Types.h"
#include "Core/String.h"
#include "Core/Memory.h"

#include "Input/Base.h"

#include <unordered_set>
#include <unordered_map>
#include <stack>
#include <filesystem>

// ---------------------------------------------------------------------
// Состояние действия. (Idle, Pressed, Released or Held)
// ---------------------------------------------------------------------
enum class ActionState {
    Idle = 0,
    Pressed,
    Released,
    Held,
};
    
// ---------------------------------------------------------------------
// Привязки (бинды) для действий. Используются в качестве абстракции над разными
// типами ввода (клавиатура, геймпад и т.д)
// ---------------------------------------------------------------------
struct ActionBinding {
    InputDevice device;
    Uint8 scancode;
    std::vector<ModifierKey> modifiers;
};

// ---------------------------------------------------------------------
// Карта действий (action). Сопостовляет название действия (action name)
// с определённой привязкой (action binding)
// ---------------------------------------------------------------------
class ActionMap {
public:
    ActionMap() = default;

    // ---------------------------------------------------------------------
    // Обновляет состояние всех действий. Использует "сырые" функции
    // по типу `Input::IsKeyPressed(SCANCODE)`
    // ---------------------------------------------------------------------
    void Update();

    void AddAction(const String& name, const ActionBinding& binding);
    void Bind(const String& name, const ActionBinding& binding);

    // ---------------------------------------------------------------------
    // Проверяют состояние бинда по имени действия.
    // ---------------------------------------------------------------------
    [[nodiscard]]
    bool IsPressed(const String& name) const;
    [[nodiscard]]
    bool IsReleased(const String& name) const;
    [[nodiscard]]
    bool IsHeld(const String& name) const;

    // ---------------------------------------------------------------------
    // Создаёт/читает (десериализует) карту действий из JSON формата.
    // ---------------------------------------------------------------------
    [[nodiscard]]
    static ActionMap LoadFromFile(const std::filesystem::path filepath);

    // ---------------------------------------------------------------------
    // Записывает (сериализует) карту действий в JSON формате.
    // ---------------------------------------------------------------------
    void SaveToFile(const std::filesystem::path filepath);

private:
    // ---------------------------------------------------------------------
    // При добавлении действия, оно оборачивается в данную структуру данных,
    // для удобства отслеживания состояний.
    // ---------------------------------------------------------------------
    struct ActionData {
        ActionState state = ActionState::Idle;
        ActionBinding binding;
    };

    std::unordered_map<String, ActionData> m_actionDataMap{};
};

// ---------------------------------------------------------------------
// Контекст действий. Позволяет фильтровать обрабатываемые действия.
//
// Контекст решает в какой момент какие действия нужно обрабатывать,
// а какие просто игнорировать.
// ---------------------------------------------------------------------
class ActionContext {
public:
    // ---------------------------------------------------------------------
    // Инициализируется при помощи `std::initializer_list<String>`.
    //
    // Нужно просто передать список обрабатываемых действий в текущем контексте
    // ---------------------------------------------------------------------
    ActionContext(const std::initializer_list<String>& actions)
        : m_actionSet(actions)
    {
    }

    // ---------------------------------------------------------------------
    // Добавить действие в контекст.
    //
    // Желательно указывать все нужные действия при инициализации, и не
    // использовать данный метод (Хотя ничего не мешает это делать,
    // и это не будет ошибкой).
    // ---------------------------------------------------------------------
    void AddAction(const String& name);

    // ---------------------------------------------------------------------
    // Возвращает `true`, если в данном контексте есть действие,
    // иначе возвращает `false`
    // ---------------------------------------------------------------------
    [[nodiscard]]
    bool HasAction(const String& name) const;

private:
    std::unordered_set<String> m_actionSet{};
};

// ---------------------------------------------------------------------
// Система действий. Глобальный класс для обработки действий
// ---------------------------------------------------------------------
class ActionSystem {
public:
    ActionSystem();

    static ActionSystem& Instance();

    FORCE_INLINE
    inline void Update()
    {
        m_actionMap.Update();
    }

    // ---------------------------------------------------------------------
    // Добавить контекст действий в стэк
    // ---------------------------------------------------------------------
    void PushContext(const ActionContext& context);

    // ---------------------------------------------------------------------
    // Убрать контекст действий из стэка
    // ---------------------------------------------------------------------
    void PopContext();

    // ---------------------------------------------------------------------
    // Указать текущую карту действий и привязок (биндов).
    // ---------------------------------------------------------------------
    void SetActionMap(const ActionMap& map);

    // ---------------------------------------------------------------------
    // Возвращает значение m_actionMap.IsPressed(name) сверяясь перед этим
    // с текущим контекстом (m_contextStack)
    // ---------------------------------------------------------------------
    [[nodiscard]]
    bool IsPressed(const String& name) const;

    // ---------------------------------------------------------------------
    // Возвращает значение m_actionMap.IsReleased(name) сверяясь перед этим
    // с текущим контекстом (m_contextStack)
    // ---------------------------------------------------------------------
    [[nodiscard]]
    bool IsReleased(const String& name) const;

    // ---------------------------------------------------------------------
    // Возвращает значение m_actionMap.IsHeld(name) сверяясь перед этим
    // с текущим контекстом (m_contextStack)
    // ---------------------------------------------------------------------
    [[nodiscard]]
    bool IsHeld(const String& name) const;

private:
    ActionMap m_actionMap{};
    std::stack<ActionContext> m_contextStack{};
};