// -*- mode: c++; -*-
#pragma once

#include "Core/Base.h"
#include "Core/Types.h"
#include "Core/String.h"
#include "Core/Memory.h"

#include "WSI/Input.h"

#include <unordered_set>
#include <unordered_map>
#include <stack>
#include <filesystem>

namespace ERUNTIME_NAMESPACE {
    // ---------------------------------------------------------------------
    // Привязки для действий. Используются в качестве абстракции над разными
    // типами ввода (клавиатура, геймпад и т.д)
    // ---------------------------------------------------------------------
    struct ActionBinding {
        InputDevice device;
        Uint8 scancode;
    };

    // ---------------------------------------------------------------------
    // Карта действий (action). Сопостовляет название действия (action name)
    // с определённой привязкой (action binding)
    // ---------------------------------------------------------------------
    class ActionMap {
    public:
        ActionMap() = default;

        void AddAction(const String& name, const ActionBinding& binding);

        // ---------------------------------------------------------------------
        // Проверяет состояние привязки по имени действия.
        //
        // Для проверки состояние использует `Input::IsKeyPressed(SCANCODE)`
        // ---------------------------------------------------------------------
        [[nodiscard]]
        bool IsPressed(const String& name) const;

        // ---------------------------------------------------------------------
        // Создаёт/читает (десериализует) карту действий из JSON формата.
        // ---------------------------------------------------------------------
        [[nodiscard]]
        static ActionMap LoadFromFile(const std::filesystem::path filepath);

        // ---------------------------------------------------------------------
        // Записывает (сериализует) карту действий в JSON формате.
        // ---------------------------------------------------------------------
        void SaveToFile(const std::filesystem::path filepath);

    private:
        std::unordered_map<String, ActionBinding> m_bindingMap{};
    };

    // ---------------------------------------------------------------------
    // Контекст действий. Позволяет фильтровать обрабатываемые действия.
    //
    // Контекст решает в какой момент какие действия нужно обрабатывать,
    // а какие просто игнорировать.
    // ---------------------------------------------------------------------
    class ActionContext {
    public:
        // ---------------------------------------------------------------------
        // Инициализируется при помощи `std::initializer_list<String>`.
        //
        // Нужно просто передать список обрабатываемых действий в текущем контексте
        // ---------------------------------------------------------------------
        ActionContext(const std::initializer_list<String>& actions)
            : m_actionSet(actions)
        {
        }

        // ---------------------------------------------------------------------
        // Добавить действие в контекст.
        //
        // Желательно указывать все нужные действия при инициализации, и не
        // использовать данный метод (Хотя ничего не мешает это делать,
        // и это не будет ошибкой).
        // ---------------------------------------------------------------------
        void AddAction(const String& name);

        // ---------------------------------------------------------------------
        // Возвращает `true`, если в данном контексте есть действие,
        // иначе возвращает `false`
        // ---------------------------------------------------------------------
        [[nodiscard]]
        bool HasAction(const String& name) const;

    private:
        std::unordered_set<String> m_actionSet{};
    };

    // ---------------------------------------------------------------------
    // Система действий. Глобальный класс для обработки действий
    // ---------------------------------------------------------------------
    class ActionSystem {
    public:
        static ActionSystem& Instance();

        // ---------------------------------------------------------------------
        // Добавить контекст действий в стэк
        // ---------------------------------------------------------------------
        void PushContext(const ActionContext& context);

        // ---------------------------------------------------------------------
        // Убрать конекст действий из стэка
        // ---------------------------------------------------------------------
        void PopContext();

        // ---------------------------------------------------------------------
        // Указать текущую карту действий и привязок.
        // ---------------------------------------------------------------------
        void SetActionMap(const ActionMap& map);

        // ---------------------------------------------------------------------
        // Возвращает значение m_actionMap.IsPressed(name) сверяясь перед этим
        // с текущим контекстом (m_contextStack)
        // ---------------------------------------------------------------------
        [[nodiscard]]
        bool IsPressed(const String& name) const;

    private:
        ActionMap m_actionMap{};
        std::stack<ActionContext> m_contextStack{};
    };
}